ehero_system_hint_1017349827=The leader of robbers, who demands a fee from those who are foolish enough to dare enter Marshan Swamp.
ehero_system_hint_1048238812=One of the many pirate captains who sail the high seas.
ehero_system_hint_1096855976=According to his own words, he is the greatest Mage of Endoria. It is certainly true that he is a powerful and self-assured Mage.
ehero_system_hint_1128925459=The ringleader of the peasants who refused to pay taxes and fomented a rebellion.
ehero_system_hint_1135160165=A living Magic Book, which has run away from its owner.
ehero_system_hint_1196114155=One of the many pirate captains who sail the high seas.
ehero_system_hint_1206884=Joe is one of Hake's robbers. He is a petty thief and a boozer.
ehero_system_hint_1255170592=He is a strong and skilled mage, the embodiment of wisdom.
ehero_system_hint_1277138769=The famous leader of the free robbers of Greenwood. A cheery fellow and a skilled archer who has come to try his hand in the tournament.
ehero_system_hint_1283939257=It's your double who will fight against you in a merciless test.
ehero_system_hint_1315111512=The shaman who has lost the power of the crystal he had stolen. Without the crystal he is greatly weakened.
ehero_system_hint_1325615446=She is a famous elven fighter who can charm even a dragon! She considers it her duty to save Great Elven Forests from strangers, giving them the kiss of death.
ehero_system_hint_1330475804=The shaman, filled with the power of Crystal of Peace, which he had stolen from the turtle.
ehero_system_hint_1346497338=In earlier times he was a legendary pirate, and thanks to you he is now resurrected, and out for the blood of his enemies.
ehero_system_hint_1421406370=He is a terrible pirate and a hopeless gambler, despite of his fatal bad luck.
ehero_system_hint_1428298746=An old enemy of the elven crown. His henchmen hide in forests and make a living by robbery.
ehero_system_hint_143103288=An enraged dwarven woman who has spent her last money to hire a troop, and has come to avenge those humans who killed her husband in the Creiston Mines.
ehero_system_hint_1439882597=Wandering the world, the ghost will scare ordinary mortals to death. Those who do not die of fright become her servants instead.
ehero_system_hint_147353950=A fierce goblin, and one of the tournament participants. The disciple of a great shaman, he succeeds in battle through the use of magic.
ehero_system_hint_1474605628=An extremely powerful magic staff, badly out of control.
ehero_system_hint_1497769102=Former High Archmage who managed to resurrect himself after his death. However, for his use of forbidden magic he was then rejected by his disciples, and now wanders the world, friendless.
ehero_system_hint_151278759=The monstrous product of evil's forces, the orcs' last hope to rule Endoria.
ehero_system_hint_1531549766=One of the many pirate captains who sail the high seas.
ehero_system_hint_1544513862=The leader of robbers, and servant of undead, this man is nothing short of an assassin.
ehero_system_hint_15572157=The Black King of the Beholders. Having left the dwarven mines, this creature settled down in the Dragons' Labyrinth, coming out only rarely.
ehero_system_hint_1562068266=One of the many pirate captains who sail the high seas.
ehero_system_hint_1605325574=The demon troopmaster, who has assembled troops in several worlds, intent to capture the dwarven capital.
ehero_system_hint_1612943363=It is the embodiment of Strength: the hardy and well-protected dragon.
ehero_system_hint_1619190203=An indifferent and highly pragmatic necromancer.
ehero_system_hint_1673994972=The younger brother, his orc-brothers amuse themselves by forcing him to pick fights with strangers.
ehero_system_hint_1738938999=The High Archdemon, ruler of the Sixth House of Demonis.
ehero_system_hint_1752409374=The commander of that troop of orcs which captured a museum of the Titans.
ehero_system_hint_1769830006=The Black Unicorn, servants of the necromancers in the Land of the Dead.
ehero_system_hint_177811461=One of the many pirate captains who sail the high seas.
ehero_system_hint_1800955131=One of the many pirate captains who sail the high seas.
ehero_system_hint_1822757593=This is your double, who will fight against you in a merciless test.
ehero_system_hint_186401838=The beautiful Demoness, terribly dangerous despite her diabolic attractiveness.
ehero_system_hint_1894113176=The duke became a vampire of his own free will, having trapped a young vampire and forcing it to bite him. And so a vampire he became, but not long before he killed the little vampire and its family.
ehero_system_hint_1910545338=The duke who dreams of seizing power on the Islands of Freedom. He is very cunning.
ehero_system_hint_1920482656=One of the many pirate captains who sail the high seas.
ehero_system_hint_194086472=It's an embodiment of Fear. This dragon casts fear into the hearts of his enemies.
ehero_system_hint_1943228676=The captain of the cursed ship, the crew of which transform into ghosts each night. A ruthless killer.
ehero_system_hint_1946440451=Valiant Sir Amber was enticed to the side of the Darkness by the henchmen of Karador. He killed himself in order that he might become a leader of the undead army.
ehero_system_hint_2047963333=The leader of the group of united wild Unicorns, which are united by their hatred of necromancers. They consider all humans and elves as necromancers.
ehero_system_hint_205230597=The former baron, now traitor to the crown, and sentenced to death.
ehero_system_hint_2067748010=He is the luckiest and the richest pirate of the Islands of Freedom.
ehero_system_hint_2070639740=A terrible Giant, and one of the tournament's participants. He believes that the power of mind is the ability to put one's head through a wall.
ehero_system_hint_2076615371=Formerly he was in the king's service, but tempted by dwarven gold, he betrayed his sovereign, and now he is in the dwarves' service. All of his men are outlaws of Darion.
ehero_system_hint_2078532947=The embodiment of uncertainty and skepticism, a cautious and prudent dragon.
ehero_system_hint_2083829736=The leader of the small gang of robbers who robbed the tax-collector.
ehero_system_hint_2088811316=A cruel cave giant whose army lives by robbing ordinary miners.
ehero_system_hint_2098425169=The kindest Giant in the world, and an alchemist! He lives alone, threatening none but those who attempt to encroach on his cave, which he considers to be his alchemist lab.
ehero_system_hint_2101475959=This rogue was a brave pirate while he lived. And even beyond death, he managed to escape the Land of Death, in order to protect his gold.
ehero_system_hint_2118887679=This ruthless and swift dragon is the very embodiment of Rage.
ehero_system_hint_211928543=The ghost of the captain of the cursed ship, the crew of which transform into ghosts each night.
ehero_system_hint_2140551409=The orc-commander, the troop of whom was ordered to abuse the elves. He is rather clever for what he is.
ehero_system_hint_234576903=This zombie guards the Underground. He leads the Army of Dawn, a mob of undead sworn to the destruction of pirates.
ehero_system_hint_276213879=This peasant was bitten by a werewolf a half year ago. When he turned into a werewolf, he became a leader.
ehero_system_hint_292523616=A necromancer who studies and breeds dragons.
ehero_system_hint_324242828=A cunning pirate who hunts for pirates' treasure.
ehero_system_hint_350258548=The Yellow King of Evil Beholders inspires fear in the peace-loving dwarves who work in the caves.
ehero_system_hint_369506228=The very embodiment of illusions, it is called the Dragon of Dreams.
ehero_system_hint_375980701=It is your double who will fight against you. It represents your future. Yes, yes, you will look like this after many years.
ehero_system_hint_383868214=A huge carnivorous plant. Unlike ordinary Thorns, this one is smart and can even talk.
ehero_system_hint_422380723=He has been a skeleton for so long that he has forgotten who he was when he was alive. According to the legend, a council of orcs has recognized him as an immortal embodiment of one of the Titans.
ehero_system_hint_435949304=A necromancer under the pay of the dwarven king, Torn Digor. His charge is to accompany those dwarves of noble origin who have perished in a battle, into the Land of the Dead.
ehero_system_hint_447059304=The cursed woman-elf, lacking both soul and heart. Only her dreams of revenge keep her alive.
ehero_system_hint_448816831=Priestess of the Temple of Blood, cruel commander of one of the first demon troops to invade Ellinia.
ehero_system_hint_488705799=The beautiful Demoness who may either charm or kill those who displease her.
ehero_system_hint_49950657=One of the three pirate-brothers who wishes to be the head of the family. He's the cleverest in the family and the most ruthless.
ehero_system_hint_509353750=It is your double, who will fight against you. It represents your future. Yes, yes, you will look like this after many years.
ehero_system_hint_515030973=The unchallenged leader of the robbers' gang, who inspires the whole forest with fear.
ehero_system_hint_569537644=A dragon who wishes to participate in the Tournament. An extremely dangerous and cunning enemy.
ehero_system_hint_605027828=A former preacher of the Temple of Light, until the orc land of Murock became his home. Having adopted the shaman's faith, he and his people became their faithful servants.
ehero_system_hint_655749=Noble Pirate
ehero_system_hint_663617467=You must kill this cruel necromancer to pass the test.
ehero_system_hint_706614246=The mad Dragon Haas, exiled from his native land, now a servant of the Titan Seth.
ehero_system_hint_70928514=Wild Duke is not an ordinary pirate, but a Thug with a capital "T"! A desperate and ruthless assassin.
ehero_system_hint_716401729=In former times he was a great general, but now he commands an undead army.
ehero_system_hint_720994254=It is your double, who will fight against you. It represents your future. Yes, yes, you will look like this after many years.
ehero_system_hint_770201438=Despite its pink coloration, this she-dragon is no easy prey, but a very fierce and dangerous creature.
ehero_system_hint_783225446=He is the only giant ever to graduate from the Darion Magic Academy. He is the owner of the biggest magic cudgel in Endoria. With one stroke, this cudgel deprives his opponents of their memory.
ehero_system_hint_808238646=It is your double, who will fight against you in a merciless test.
ehero_system_hint_808441149=This is one of the three pirate-brothers who wish to become head of the family. He compensates for his lack of intellect with his great strength and endurance.
ehero_system_hint_816836869=This captain is a true terror of seas, and one of the legendary pirates. He is outlawed even on the Islands of Freedom.
ehero_system_hint_864829444=This is the very embodiment of curiosity. Very quick, yet almost defenseless, a naive dragon.
ehero_system_hint_92028267=The knight who sold his soul to the demons. Now he guards their world.
ehero_system_hint_946870331=This is an enchantress whose appearance was distorted by the same magic to which she had devoted all her life. She is one of the tournament participants.
ehero_system_hint_947831501=A creature from the other world, which can enslave others' minds. It is gathering for itself an army of weak-willed slaves.
ehero_system_hint_978705779=Son of the head of the Magic Academy. One fateful day he received a dark sword, which subordinated his will to its own, and transformed this knight into a ruthless killer.
